src/cf/InformationRegisters/ОчередьВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтаусБронирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтаусБронирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БронированиеПодтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БронированиеОтклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БронированиеНовое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/Бронирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Бронирование</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаБронирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаКомандировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусБронирование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтаусБронирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ЗаявкаНаКомандировку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаКомандировку</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаКомандировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланыКомандировок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемыйРезультат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьПроезда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гостиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Гостиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьПроживания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтаусБронирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтаусБронирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ОчередьВходящихСообщений/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс 

Процедура ДобавитьСообщение(ОтветноеСообщение) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОчередьВходящихСообщений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = Новый УникальныйИдентификатор();
	МенеджерЗаписи.Статус = Перечисления.СтатусСообщения.Новое; 
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.Хранилище = ОтветноеСообщение; 
	МенеджерЗаписи.Записать();
	
КонецПроцедуры	

Процедура УстановитьСтатусОбработан(Идентификатор) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОчередьВходящихСообщений.СоздатьНаборЗаписей();
	МенеджерЗаписи.Отбор.Идентификатор.Установить(Идентификатор);
	МенеджерЗаписи.Прочитать();  
	
	Если МенеджерЗаписи.Количество() Тогда
		Запись = МенеджерЗаписи.Получить(0);	
		Запись.Статус = Перечисления.СтатусСообщения.Обработано; 
		МенеджерЗаписи.Записать(); 
	КонецЕсли;
	
КонецПроцедуры	

Процедура ОбработатьВходящиеСообщения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьВходящихСообщений.Идентификатор КАК Идентификатор,
		|	ОчередьВходящихСообщений.Хранилище КАК Хранилище
		|ИЗ
		|	РегистрСведений.ОчередьВходящихСообщений КАК ОчередьВходящихСообщений
		|ГДЕ
		|	ОчередьВходящихСообщений.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусСообщения.Новое);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбработатьСообщение(ВыборкаДетальныеЗаписи.Хранилище); 
		УстановитьСтатусОбработан(ВыборкаДетальныеЗаписи.Идентификатор);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьСообщение(ТекстСообщения)
	
	ЧтениеJSON = Новый ЧтениеJSON;  
	ЧтениеJSON.УстановитьСтроку(ТекстСообщения);  
	Объект = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаявкаНаКомандировку") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бронирование.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Бронирование КАК Бронирование
		|ГДЕ
		|	Бронирование.ЗаявкаНаБронирование = &ЗаявкаНаБронирование";
		
		Запрос.УстановитьПараметр("ЗаявкаНаБронирование", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Брнирование = Документы.Бронирование.СоздатьДокумент();
			Брнирование.Дата = ТекущаяДатаСеанса();
			Брнирование.СтатусБронирование =  Перечисления.СтаусБронирования.БронированиеНовое; 
			Брнирование.ЗаявкаНаБронирование = Объект.Ссылка;
			Брнирование.Записать();
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.Бронирование") Тогда
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаКомандировку.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаКомандировку КАК ЗаявкаНаКомандировку
		|ГДЕ
		|	ЗаявкаНаКомандировку.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ЗаявкаНаБронирование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Заявка = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Заявка.СтаусБронирования = Объект.СтатусБронирование;
		Заявка.Записать();
	КонецЦикла;
	
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти
